[
    "Tim Andersen is a Professor at Boise State University. Research Areas: Artificial Neural Network, Genetic Algorithms Paper 1 Summary: This study presents an updated version of DockoMatic, a software tool that generates cyclic peptide analog structure files from protein database files. The authors validate the accuracy of this utility by testing its ability to predict binding affinity and structure consistency of peptide analogs against experimentally determined structures. Using a combination of DockoMatic and Treepack, the researchers demonstrate high-throughput virtual screening capabilities, with the ability to evaluate up to 1,000,000 simulations in approximately one week. The results show promising predictive power, with binding energy predictions within 3.5 kcal mol^-1 and ligand orientation comparisons within 1.8 Å root mean square deviation. Paper 2 Summary: This paper proposes a modified backpropagation-based training approach to mitigate the bias towards large input feature values in multilayer networks. The method involves appending complementary inputs to the original feature vectors, effectively doubling the number of inputs without increasing network complexity. By doing so, it aims to reduce the skew in the learned decision surface, leading to more robust and balanced models. The approach is validated through a proof that demonstrates the modified network can be mapped back to the original feature space. Google Scholar: https://scholar.google.com/citations?user=aN4U3pAAAAAJ&hl=en Office: CCP 251 Availability: nan Email: tandersen@boisestate.edu",
    "Jim Buffenbarger is a Associate Professor at Boise State University. Research Areas: Software Engineering, Programming Languages, Programming Language Translators Paper 1 Summary: This research presents a novel branching and merging strategy for parallel software development, addressing the limitations of traditional approaches. The proposed strategy, termed \"merging at a label,\" enables efficient updating of active branches from new baselines, mitigating unnecessary branch proliferation. By adopting this approach, the study demonstrates improved change isolation in software configuration management systems. The method has been successfully applied in an industrial setting, showcasing its practical effectiveness. Google Scholar: https://scholar.google.com/citations?user=fY5q3E0AAAAJ&hl=en Office: CCP 258 Availability: nan Email: buff@cs.boisestate.edu",
    "Steven Cutchin is a Associate Professor at Boise State University. Research Areas: Scientific Data Visualization, Immersive Environments, Serious Games, High Performance Computing, Multi-terabyte data visualization Paper 1 Summary: This study aims to enhance the transparency of blockchain data by developing a comprehensive framework for visualizing Bitcoin transactions. The approach utilizes refined data interpretation and visualization tools to identify irregularities in transaction patterns, potentially indicating fraudulent activity. By applying this framework to case studies and data analysis, the research reveals hidden patterns and provides interactive visualization tools to facilitate anomaly detection. The contribution of this work lies in its potential to improve security and integrity within the cryptocurrency ecosystem, particularly through the identification of dark web-connected transactions. Paper 2 Summary: This study investigates the redundancy introduced by equirectangular projection in 360-degree images, analyzing its structure across the image using the 360SP dataset. The research aims to develop spherical compression algorithms that take advantage of this redundancy, improving upon traditional compression methods like JPEG or PNG. By doing so, the study seeks to enhance the immersive experience of Virtual Reality users by reducing loading times and increasing image quality. The findings have the potential to optimize storage and transmission of 360-degree images. Google Scholar: https://scholar.google.com/citations?user=vH5VbsQAAAAJ&hl=en Office: CCP 356 Availability: nan Email: stevencutchin@boisestate.edu",
    "Gaby Dagher is a Associate Professor at Boise State University. Research Areas: Cyber Security for AI, Game Theory with AI, LLM Privacy, Differential Privacy, Drone Security Paper 1 Summary: This research contributes to the field of federated learning by introducing a novel blockchain-enabled framework, called \\Sys, to detect data poisoning attacks. The framework decentralizes the global server's role and utilizes a judge model, produced and verified by participating clients, to detect poisoned model updates. By leveraging blockchain technology, \\Sys provides a robust and scalable solution to enhance the security and integrity of federated learning models. The core method involves a consensus-based approach to create a unified judge model that effectively identifies data poisoning attacks. Paper 2 Summary: This research proposes AegisBlock, a patient-centric framework for sharing medical records while maintaining patient anonymity. The framework utilizes a blockchain-based approach, where patients control access to their data and miners verify requests from researchers. AegisBlock enables secure and trustworthy data sharing through time-based range queries, ensuring patient privacy and data integrity. The framework is shown to be scalable and efficient, even in the presence of malicious miners, through experimental evaluation. Google Scholar: https://scholar.google.com/citations?user=c77MRUEAAAAJ&hl=en Office: CCP 350 Availability: nan Email: gabydagher@boisestate.edu",
    "Bogdan Dit is a Clinical Associate Professor at Boise State University. Research Areas: software engineering, software evolution and maintenance, Program Comprehension, Feature Location, Software Repository Mining Google Scholar: https://scholar.google.com/citations?user=txY2NHUAAAAJ&hl=en Office: CCP 245 Availability: nan Email: bogdandit@boisestate.edu",
    "Jerry Alan Fails is a Professor at Boise State University. Research Areas: Human-Computer Interaction, Educational Technologies with Children, Ubiquitous Computing, Artificial Intelligence & Extended Reality Paper 1 Summary: This paper critically examines the challenges of interdisciplinary collaborations, particularly how disciplinary specialization can hinder effective teamwork. The research highlights the importance of sharing implicit assumptions and \"disciplinary lore\" to facilitate collaboration. Through historical case studies of computer science and anthropology collaborations, the paper illustrates the benefits of explicitly articulating these assumptions. By doing so, it contributes to the development of more effective interdisciplinary research methods, combining insights from human behavioral ecology and human-computer interaction. Paper 2 Summary: This project explores the use of social imaginaries to understand children's visions for a sustainable future through co-design methodologies. By analyzing five case studies from diverse geographic regions, the research examines variations in design practices and artifacts. The study applies a social imaginary lens to investigate how children demonstrate a shared understanding of a pro-social world, focusing on environmental sustainability. The primary contribution is the illustration of social imaginaries as a framework for interpreting and organizing co-design in this context. Google Scholar: https://scholar.google.com/citations?user=eO71_M8AAAAJ&hl=en Office: CCP 363 Availability: nan Email: jerryfails@boisestate.edu",
    "Sarah Frost is a Clinical Assistant Professor at Boise State University. Research Areas: Google Scholar: nan Office: CCP 253 Availability: nan Email: sarahfrost@boisestate.edu",
    "Eric Henderson is a Clinical Associate Professor at Boise State University. Research Areas: Natural Language Processing, Machine Learning, Networking, Software Google Scholar: nan Office: CCP 257 Availability: nan Email: EHenderson@boisestate.edu",
    "Luke Hindman is a Clinical Associate Professor at Boise State University. Research Areas: Digital Signal Processing, Distributed File Systems, Amateur Radio, Embedded Systems, Computer Accessibility Google Scholar: nan Office: CCP 248 Availability: nan Email: mlukehindman@boisestate.edu",
    "Amit Jain is a Professor at Boise State University. Research Areas: Parallel Computing, Beowulf clusters, Operating Systems, Distributed Systems, Computer Science Education Google Scholar: nan Office: CCP 355 Availability: nan Email: ajain@boisestate.edu",
    "Sindhu Reddy Kalathur Gopal is a Assistant Professor at Boise State University. Research Areas: Google Scholar: nan Office: CCP 359 Availability: nan Email: sindhukalathur@boisestate.edu",
    "Casey Kennington is a Associate Professor at Boise State University. Research Areas: Non-verbal behaviour, Natural Language Processing Paper 1 Summary: This research introduces Recognizing Young Searchers (RYSe), a system aiming to adapt web search environments for children. RYSe leverages lexical and syntactical features to identify users in the Concrete Operational stage of development, typically associated with children ages 7-11. The approach uses machine learning to distinguish between queries formulated by children and adults based on cognitive traits inferred from single queries. By doing so, RYSe contributes to the development of more child-friendly web search environments. Paper 2 Summary: This study explores the impact of visual cues on children's ability to navigate search engine results pages (SERPs) and select relevant resources. The research focuses on the readability and text difficulty of SERP snippets, aiming to improve children's information discovery experience. Using a mixed-methods approach, combining quantitative user-interface interaction data and qualitative interview data, the study investigates the effect of visual cues on children's SERP navigation. The findings contribute to the development of more child-friendly search interfaces, particularly for children aged 6-12. Google Scholar: https://scholar.google.com/citations?user=Um4ZbbgAAAAJ&hl=en Office: CCP 254 Availability: nan Email: caseykennington@boisestate.edu",
    "Andre Keys is a Clinical Instructor at Boise State University. Research Areas: Google Scholar: nan Office: CCP 250 Availability: nan Email: andrekeys@boisestate.edu",
    "Min Long is a Associate Professor at Boise State University. Research Areas: Computational Nuclear Materials Science, Multiphysics Simulation and Modeling, Computational Fluid Dynamics (CFD) in Astrophysics Google Scholar: nan Office: CCP 347 Availability: nan Email: minlong@boisestate.edu",
    "Hoda Mehrpouyan is a Associate Professor at Boise State University. Research Areas: Privacy-Preserving Techniques, Requirements Engineering for Privacy, System-Level Reliability Analysis for Cyber-Physical Systems (CPS), Resilient Complex Engineered Systems Google Scholar: https://scholar.google.com/citations?user=c4xMhHEAAAAJ&hl=en Office: CCP 252 Availability: nan Email: hodamehrpouyan@boisestate.edu",
    "Shane Panter is a Clinical Assistant Professor at Boise State University. Research Areas: Software Engineering, Systems, Cybersecurity, Software Security Google Scholar: https://scholar.google.com/citations?user=0B7MuswAAAAJ&hl=en Office: CCP 246 Availability: nan Email: shanepanter@boisestate.edu",
    "Kathryn Rodgers is a Lecturer at Boise State University. Research Areas: Google Scholar: nan Office: CCP 256 Availability: nan Email: kathrynrodgers@boisestate.edu",
    "Edoardo Serra is a Associate Professor at Boise State University. Research Areas: Graph Representation Learning, Unsupervised Neural Networks, Machine Learning Interpretability, and Robustness, ML/AI applications in Cyber and National Security Google Scholar: https://scholar.google.com/citations?user=vepzEcUAAAAJ&hl=it Office: CCP 349 Availability: nan Email: edoardoserra@boisestate.edu",
    "Elena Sherman is a Associate Professor at Boise State University. Research Areas: Static and dynamic program analyses, Program testing, Decision procedures Google Scholar: https://scholar.google.com/citations?user=YVovscMAAAAJ&hl=en Office: USB 208B Availability: nan Email: elenasherman@boisestate.edu",
    "Francesca Spezzano is a Associate Professor at Boise State University. Research Areas: Social Media Mining, Social Network Analysis, National security, Data Science Google Scholar: https://scholar.google.com/citations?user=u_5TCGoAAAAJ&hl=en Office: CCP 348 Availability: nan Email: francescaspezzano@boisestate.edu",
    "Max Taylor is a Assistant Professor at Boise State University. Research Areas: Parallel computing, Parallel application development, Parallel algorithms and data structures, Computer Science Education Google Scholar: https://scholar.google.com/citations?user=2khwrLsAAAAJ&hl=en Office: CCP 360 Availability: nan Email: maxtaylor@boisestate.edu",
    "Mason Vail is a Clinical Assistant Professor at Boise State University. Research Areas: Google Scholar: nan Office: CCP 358 Availability: nan Email: masonvail@boisestate.edu",
    "Jyh-haw Yeh is a Professor at Boise State University. Research Areas: Applied Crypto, Network and Cloud Security and Privacy, Cybersecurity Education and Workforce Development Google Scholar: https://scholar.google.com/citations?user=oDEimkEAAAAJ&hl=zh-TW Office: CCP 247 Availability: nan Email: jhyeh@boisestate.edu",
    "Yu Zhang is a Assistant Professor at Boise State University. Research Areas: Domain Adaptive Computer Vision, Computer Vision in 3D and Robotics, Efficient and Secured Machine Learning and Edge AI Google Scholar: https://scholar.google.com/citations?user=9OegmjMAAAAJ&hl=en Office: CCP 249 Availability: nan Email: YZhang@boisestate.edu",
    "Xinyi Zhou is a Assistant Professor at Boise State University. Research Areas: Trustworthy Generative AI, Human-Centered LLMs, Multimodal Machine Learning, LLM Agents, Interdisciplinary & Applied AI Google Scholar: https://scholar.google.com/citations?user=9U_Ge4MAAAAJ Office: CCP 255 Availability: nan Email: XinyiZhou@boisestate.edu",
    "Jun Zhuang is a Assistant Professor at Boise State University. Research Areas: Graph machine learning, Quantum machine learning Google Scholar: https://scholar.google.com/citations?user=Hdc90UMAAAAJ&hl=zh-CN Office: CCP 354 Availability: nan Email: junzhuang@boisestate.edu"
]